run/freeBoxInRegularWaves/baseCase/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
//        type            wavemakerMovement;
//        wavemakerDictName wavemakerMovementDict;
//        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedNormalSlip;
        n               (0 0 -1);
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
    box
    {
        type            calculated;
    }
    sidewalls
    {
        type            empty;//fixedValue;
    }
    atmosphere
    {
        type            fixedNormalSlip;
        n               (0 0 1);
    }
}


// ************************************************************************* //
