run/freeBoxInRegularWaves/baseCase/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          waveProperties;
}

inlet
{
    alpha           alpha.water;
    waveModel       StokesV;
    nPaddle         1;
    waveHeight      0.1;
    waveAngle       0;
    rampTime        4;
    activeAbsorption yes;
    wavePeriod      1.2;
}

outlet
{
    alpha           alpha.water;
    waveModel       shallowWaterAbsorption;
    nPaddle         1;
}

// ************************************************************************* //
